'''2. Напишите программу, которая принимает на вход число N и 
выдает набор произведений чисел от 1 до N.    
    Пример:    
    - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
'''
N = int(input('Введите число N: '))

def Mult(N):
    mult = 1
    i = 1
    e = ', '
    print("[", end = ' ')
    while i <= N :
        mult = mult * i
        if i == N:
            e = ' '
        print(mult, end = e)
        i = i + 1
    print("]")
Mult(N)